Fix issues with starlight style
